help_text = """Darkness
├─ osu! команды
│  ├─ 🎮 Последние игры
│  │  ├─   /recent | /rs 📖
│  │  │    последние игры
│  │  │
│  │  └─   /fix
│  │       фикс последней игры
│  │
│  ├─ 📑 Старые игры
│  │  ├─   /score | /s  📖
│  │  │    игры на карте из чата
│  │  │
│  │  └─   ссылка на скор
│  │         (без команды)
│  │         ссылке с сайта
│  │
│  ├─ 📊 Статистика
│  │   ├─  /profile | /p
│  │   │    профиль
│  │   │
│  │   ├─  /pc
│  │   │    сравнение профилей
│  │   │
│  │   ├─  /nochoke | /n 🔧📖
│  │   │    топ100 без миссов
│  │   │
│  │   ├─  /mods
│  │   │    % модов в топ100
│  │   │
│  │   ├─  /mappers
│  │   │    мапперы в топ100
│  │   │
│  │   ├─  /average | /a
│  │   │    min-avg-max в топ100
│  │   │
│  │   ├─  /reaverage | /rea
│  │   │    min-avg-max последних
│  │   │    игр
│  │   │
│  │   ├─  /beatmaps | /b 💾
│  │   │    теги, юзертеги, и тд...
│  │   │
│  │   └─  /anime
│  │         аниме фоны в топ100
│  │
│  ├─ 🗺 Карты
│  │   ├─  /simulate
│  │   │    посчитать рр карты
│  │   │
│  │   ├─  /music
│  │   │    mp3 из карты
│  │   │
│  │   └─  /maps_skill
│  │        подбор карт по скилам
│  │
│  ├─ 🖼 Карточки
│  │   ├─  /card | /c
│  │   │    профиль
│  │   │
│  │   ├─  /skills
│  │   │    по скилам (рр)
│  │   │
│  │   ├─  /cardtop | /ct
│  │   │    топ-5 рр
│  │   │
│  │   └─  /map | /cardmap
│  │       карта (beatmap)
│  │
│  ├─ ⚔️ Дейли челлендж
│  │   └─  /challenge 💾
│  │         главное меню дейли
│  │
│  ├─ 🕹 Игры
│  │   └─  /higherlower | /hl 💾📖
│  │        отгадывание стат
│  │        случайных скоров
│  │
│  ├─ 👥 Чат
│  │   └─  /topchat | /l
│  │          топ чата
│  │
│  └─ ⚙️ Настройки для осу
│        ├─  /settings
│        │
│        └─  /name
│              ссылка на авторизацию
│
└─  Другое
     ├─  /reminders
     │    напоминалки в чате
     │
     ├─  /doubt | /blacks
     │    отправляет гифки
     │
     ├─  /gn
     │    гемблинг картинок
     │
     └─  /ping | /uptime"""
help_hint = """

💾 - Работает только после авторизации
🔧 - Есть настройки для этой команды
📖 - Доп. помощь /help *команда*"""


HELP_TEXTS = {
    "nochoke": """
📖
    /n | /nochoke
    <b>если бы топ 100 
    был без миссов</b>

    <code>/n</code> — с сохраненным ником
    <code>/nochoke</code> — то же самое
    
    <code>%</code> <b>— лимит миссов</b>
    <code>/nochoke %5</code> — например, 5шт

    <code>/nochoke vaxei</code> — другой ник
    <code>/n vaxei %11</code>

    
""","rs": """
📖
    /r | /rs | /recent
    <b>показывает последние
    игры в виде карточек</b>

    <code>/rs</code> — с сохраненным ником
    <code>/recent</code> — то же самое
    
    <code>/rs vaxei</code> — с чужим ником

    в <code>/settings</code> есть настройки:
    
    1. Показывать фейлы?* - Показывать ли скоры с фейлами
    
""","score": """
📖
    /s | /sc | /score
    <b>показывает лучший скор (или несколько)</b>

    1. Пустая (<code>/sc </code> или <code>/sc vaxei</code>), карта берется из последнего сообщения в чате

    2. Ответом на недавние сообщения (от бота), где есть карта или скор: например, если кто нибудь написал <code>/rs</code> и бот отправил скор другому пользователю, если ответить на это сообщение <code>/sc</code>, то покажутся твои (или с введенным ником) скоры именно на той карте. Это полезно, если после того <code>/rs</code> были другие команды со скорами 

    Спискок команд, которые могут использовать такую функцию:   
<code>/rs</code>
<code>/fix</code> 
<code>/simulate</code> 
<code>*ссылка на карту* (карта, которую бот прислала в ответ)</code>
<code>*ссылка на скор* (скор, который бот прислала в ответ)</code>    
<code>/music (если была ссылка на конкретную сложность)</code>
<code>/score</code> (ответ на другую такую же команду)   
    
    💾
    <code>/sc</code> — с сохраненным ником
    <code>/score</code> — то же самое
    
    ➕
    <code>/sc vaxei</code> — с чужим ником 
    <code>/score vaxei</code> 
""",
    "default":"""ничего не выбрано, а иначе здесь бы появился какой-то полезный текст.
    ""","higherlower": """
📖
    /higherlower | /hl
    <b>игра, где нужно угадавать 
    показатели скоров.</b>

    Механики:
    +1 HP, +1 очков за угаданный скор
    +1 HP за рекорд очков(10% шанс)
    -1 HP за неправильный выбор    

    Лидерборд:
    в команде /topchat
"""
}

PARAMS_TEMPLATE = {
    "Моды": {
        "type": "mods",
        "msg": "моды, например HR или dtHD...",
        "default": "NM"
    },
    # "Комбо": {
    #     "type": "combo",
    #     "msg": "максимальное комбо при игре, например 100",
    #     "min": "1",
    #     "default": "1"
    # },
    "Точность": {
        "type": "accuracy",
        "msg": "точность, например 80 или 96,5",
        "default": "100"
    },
    "Скорость": {
        "type": "rate",
        "msg": "рейт чендж лазера, например 1 или 1.35",
        "default": "1"
    },
    "Лазер": {
        "type": "lazer",
        "msg": "лазер? да/нет",
        "default": "True"
    },
    "300": {
        "type": "300k",
        "msg": "количество 300 (good)",
        "min": "0",
        "default": "1"
    },
    "100": {
        "type": "100k",
        "msg": "количество 100 (ok)",
        "min": "0",
        "default": "0"
    },    
    "50": {
        "type": "50k",
        "msg": "количество 50 (meh)",
        "min": "0",
        "default": "0"
    },
    "мисс": {
        "type": "miss",
        "msg": "количество миссов",
        "min": "0",
        "default": "0"
    }
}

UNLUCKY_MESSAGES = [ "Не повезло", "Ничего", "Пусто"]
CHALLENGE_COMMANDS = ["/challenge", "/next_challenge", "/finish", "/skip", "/name", "/info", "/force_finish", "/leaderboard"]

fail_texts = [
                    "Не повезло",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Неа",
                    "Не",
                    "Мылся?",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Пусто",
                    "Не повезло",
                    "Ничего",
                    "Может лучше в осу поиграть? у тебя кажется только это получается в жизни",
                    "Пусто",
                    "Не надо стараться",
                    "Сорян",
                    "Неа",
                    "Не",
                    "..?",
                    "...",
                    "-_-",
                    "xD",
                    "xdx",
                ]