ACTIVITIES = {
    "fish": {
        "start": "🎣 Ты закинул удочку...",
        "event": "🐟 Клюет!",
        "button": "Подсечь",
        "loot": [
            ("🐟 Карась", 70, 5, 10),
            ("🐠 Форель", 20, 15, 25),
            ("🦈 Акула", 10, 50, 100),
        ]
    },

    "mine": {
        "start": "⛏️ Ты начинаешь копать...",
        "event": "💎 Найдена жила!",
        "button": "Добыть",
        "loot": [
            ("🪨 Камень", 70, 2, 5),
            ("⛏️ Железо", 20, 10, 20),
            ("💎 Алмаз", 10, 50, 100),
        ]
    }
}