
d_file = "file_osugames_elo"

BANNER_OPTIONS = [
    "https://i.ibb.co/YBQ0xMpx/image-9.png",
]

SOURCE_OPTIONS = [
    "⤴️ Против скора, играет только противник",
    "🆚 Играю еще раз, более честное 1v1"
]

GOAL_OPTIONS = [
    "🆕 SCORE-V2",
    "👨‍🦳 SCORE-STD",
    "🏹 Точность",
    "❌ Миссы",
    "🔗 Комбо"
]

TIME_OPTIONS = [
    "⏳ Таймер 1 ч.",
    "⏳ Таймер 2 ч.",
    "⏳ Таймер 3 ч.",
    "⏳ Таймер 6 ч.",
    "⏳ Таймер 12 ч.",
    "⏳ Таймер 24 ч.",
    "⏳ Таймер 48 ч."
]

CROSSCLIENT_OPTIONS = [
    "◽️ Игра на любом клиенте",
    "🔸 Только стейбл клиент",
    "🔹 Только лaзер клиент"
]

POLICY_OPTIONS = [
    "🔓 Не подтверждать соперника и таймер",
    "🔐 Подтверждать соперника и таймер",
]

MOD_OPTIONS = [
    "DT",
    "HD",
    "HR",
    "HT",
    "FL",
    "EZ",
    "RX",
    "AP",
    "FM"
]